Австралия/src/Catalogs/BillsOfMaterialsHierarchy/BillsOfMaterialsHierarchy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BillsOfMaterialsHierarchy</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.BillsOfMaterials</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/BillsOfMaterials/BillsOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BillsOfMaterials</name>
  <owners>Catalog.Products</owners>
  <attributes>
    <name>ProductCharacteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </attributes>
  <attributes>
    <name>NormalSpoilage</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseRouting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PlannedCost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.BOMStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>BillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Operations</name>
    <attributes>
      <name>ActivityNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NextActivityNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>CatalogRef.ManufacturingActivities</types>
      </type>
    </attributes>
    <attributes>
      <name>Workload</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operation</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>TimeNorm</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TimeUOM</name>
      <type>
        <types>CatalogRef.TimeUOM</types>
      </type>
    </attributes>
    <attributes>
      <name>StandardTimeInUOM</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StandardTime</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CalculationMethod</name>
      <type>
        <types>EnumRef.BOMOperationCalculationMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Content</name>
    <attributes>
      <name>ContentRowType</name>
      <type>
        <types>EnumRef.BOMLineType</types>
      </type>
    </attributes>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <comment>Unit of measure</comment>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NormalScrap</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>CatalogRef.ManufacturingActivities</types>
      </type>
    </attributes>
    <attributes>
      <name>ActivityNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>CostPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Cost</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GoodsForSale</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ManufacturedInProcess</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>CalculationMethod</name>
      <type>
        <types>EnumRef.BOMContentCalculationMethod</types>
      </type>
    </attributes>
    <attributes>
      <name>ActivityConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ByProducts</name>
    <attributes>
      <name>Product</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <comment>Unit of measure</comment>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Activity</name>
      <type>
        <types>CatalogRef.ManufacturingActivities</types>
      </type>
    </attributes>
    <attributes>
      <name>ActivityConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/BillsOfMaterialsHierarchy/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure CreateNewHierarchy(RefBOM) Export
	
	If Not ValueIsFilled(RefBOM) Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	ParentHierarchy.Ref AS Ref,
	|	ParentHierarchy.Parent AS Parent,
	|	ParentHierarchy.Specification AS Specification
	|INTO ParentHierarchyTable
	|FROM
	|	Catalog.BillsOfMaterialsHierarchy AS ParentHierarchy
	|WHERE
	|	ParentHierarchy.Specification = &RefBOM
	|	AND NOT ParentHierarchy.DeletionMark
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ChildHierarchyTable.Ref AS Ref
	|FROM
	|	ParentHierarchyTable AS ParentHierarchyTable
	|		INNER JOIN Catalog.BillsOfMaterialsHierarchy AS ChildHierarchyTable
	|		ON ParentHierarchyTable.Ref = ChildHierarchyTable.Parent
	|WHERE
	|	NOT ChildHierarchyTable.DeletionMark
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	BillsOfMaterials.Ref AS Specification,
	|	BillsOfMaterials.Description AS Description
	|FROM
	|	Catalog.BillsOfMaterials AS BillsOfMaterials
	|		LEFT JOIN ParentHierarchyTable AS ParentHierarchy
	|		ON BillsOfMaterials.Ref = ParentHierarchy.Specification
	|			AND (ParentHierarchy.Parent = VALUE(Catalog.BillsOfMaterialsHierarchy.EmptyRef))
	|WHERE
	|	BillsOfMaterials.Ref = &RefBOM
	|	AND NOT BillsOfMaterials.DeletionMark
	|	AND ParentHierarchy.Ref IS NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	ParentHierarchy.Ref AS RefHierarchy,
	|	BillsOfMaterials.Ref AS Specification
	|FROM
	|	Catalog.BillsOfMaterials AS BillsOfMaterials
	|		INNER JOIN ParentHierarchyTable AS ParentHierarchy
	|		ON BillsOfMaterials.Ref = ParentHierarchy.Specification
	|WHERE
	|	NOT BillsOfMaterials.DeletionMark";
	
	Query.SetParameter("RefBOM", RefBOM);
	
	Result = Query.ExecuteBatch();
	
	Selection = Result[1].Select();
	While Selection.Next() Do
		Selection.Ref.GetObject().SetDeletionMark(True);
	EndDo;
	
	Selection = Result[2].Select();
	If Selection.Next() Then
		NewHierarchyItem = Catalogs.BillsOfMaterialsHierarchy.CreateItem();
		FillPropertyValues(NewHierarchyItem, Selection);
		NewHierarchyItem.Write();
		CreateChildHierarchy(Selection.Specification, NewHierarchyItem.Ref);
	EndIf;
	
	Selection = Result[3].Select();
	While Selection.Next() Do
		CreateChildHierarchy(Selection.Specification, Selection.RefHierarchy);
	EndDo;
	
EndProcedure

Procedure ClearBOMHierarchy(RefBOM) Export
	
	If Not ValueIsFilled(RefBOM) Then
		Return;
	EndIf;
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	BillsOfMaterialsHierarchy.Ref AS Ref
	|FROM
	|	Catalog.BillsOfMaterialsHierarchy AS BillsOfMaterialsHierarchy
	|WHERE
	|	BillsOfMaterialsHierarchy.Specification = &RefBOM
	|	AND NOT BillsOfMaterialsHierarchy.DeletionMark";
	
	Query.SetParameter("RefBOM", RefBOM);
	
	Result = Query.Execute();
	
	Selection = Result.Select();
	While Selection.Next() Do
		Selection.Ref.GetObject().SetDeletionMark(True);
	EndDo;
	
EndProcedure

#EndRegion

#Region Private

Procedure CreateChildHierarchy(ParentBOM, ParentHierarchy)
	
	Query = New Query;
	Query.Text = 
	"SELECT
	|	BillsOfMaterialsContent.Specification AS Specification,
	|	ChildBillsOfMaterials.Description AS Description
	|FROM
	|	Catalog.BillsOfMaterials.Content AS BillsOfMaterialsContent
	|		INNER JOIN Catalog.BillsOfMaterials AS ChildBillsOfMaterials
	|		ON BillsOfMaterialsContent.Specification = ChildBillsOfMaterials.Ref
	|WHERE
	|	BillsOfMaterialsContent.Ref = &ParentBOM
	|	AND NOT ChildBillsOfMaterials.DeletionMark";
	
	Query.SetParameter("ParentBOM", ParentBOM);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		
		NewHierarchyItem = Catalogs.BillsOfMaterialsHierarchy.CreateItem();
		FillPropertyValues(NewHierarchyItem, Selection, "Description, Specification");
		NewHierarchyItem.Parent = ParentHierarchy;
		NewHierarchyItem.Write();
		
		CreateChildHierarchy(Selection.Specification, NewHierarchyItem.Ref);
		
	EndDo;
	
EndProcedure

#EndRegion

#EndIf
